# Missing Values

In [23]:
import numpy as np
import pandas as pd

In [24]:
_d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1.2,3,4],'D':[2,3,4]}

In [25]:
_d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1.2, 3, 4], 'D': [2, 3, 4]}

In [26]:
_df = pd.DataFrame(_d)

In [27]:
_df

     A    B    C  D
0  1.0  5.0  1.2  2
1  2.0  NaN  3.0  3
2  NaN  NaN  4.0  4

In [28]:
_df.dropna()

     A    B    C  D
0  1.0  5.0  1.2  2

In [29]:
_df.dropna(axis=1)

     C  D
0  1.2  2
1  3.0  3
2  4.0  4

In [30]:
_df

     A    B    C  D
0  1.0  5.0  1.2  2
1  2.0  NaN  3.0  3
2  NaN  NaN  4.0  4

In [31]:
_df.dropna(thresh = 3)

     A    B    C  D
0  1.0  5.0  1.2  2
1  2.0  NaN  3.0  3

In [32]:
_df.fillna(value='NO VALUE')

          A         B    C  D
0       1.0       5.0  1.2  2
1       2.0  NO VALUE  3.0  3
2  NO VALUE  NO VALUE  4.0  4

In [33]:
_df

     A    B    C  D
0  1.0  5.0  1.2  2
1  2.0  NaN  3.0  3
2  NaN  NaN  4.0  4

In [36]:
_df['A'] = _df['A'].fillna(value=_df['A'].mean())

In [37]:
_df

     A    B    C  D
0  1.0  5.0  1.2  2
1  2.0  NaN  3.0  3
2  1.5  NaN  4.0  4

# Groupby

In [39]:

# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [40]:
df = pd.DataFrame(data)

In [41]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [43]:
df.groupby('Company')

In [44]:
byComp = df.groupby('Company')

In [45]:
byComp

In [46]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [47]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [48]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [49]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [50]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [51]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [52]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000